q61org/CH559_EasyUSBHost/main.c
// ================

void cfg_writereg_and_update(uint8_t addr, uint8_t value)
{
    addr &= 0x7f;
    if (addr >= SPI_REG_SIZE) return;
    spi_writereg(addr, value);
    uint8_t r = spi_updatecfg(addr);
    if (r & 0x80) {
#if 0
        if (g_numKbds > 0 && !(g_raw_mode && cfg_separatelock())) {
            kbd_updatelocks(cfg_locks(), 0);
        } else {
            g_default_locks = cfg_locks();
        }
#endif
    }
}

// ================

uint8_t strlen_xdata_s(const __xdata char *str, uint8_t maxlen)
{
    uint8_t r = 0;
    while (r < maxlen) {
        if (*str++ == 0) break;
        r++;
    }
    return r;
}

#define UART_CMD_MAXLEN 8

void uartcmd_process(const __xdata char *cmd)
{
    uint8_t len = strlen_xdata_s(cmd, UART_CMD_MAXLEN);
    DEBUG_OUT("UART command [%d] %s\n", len, cmd);
    if (cmd[0] == '!') {
        if (cmd[1] == 's' && len == 2) {
            static __xdata uint8_t id[8];
            get_chip_id(id);
            for (uint8_t i = 0; i < 8; i++) {
                ringbuf_write(&g_rb_out, bin2hexchar(id[7 - i] >> 4));
                ringbuf_write(&g_rb_out, bin2hexchar(id[7 - i]));
            }
            ringbuf_write(&g_rb_out, 0x0a);
        } else if (cmd[1] == 'v' && len == 2) {
            const char *v = VERSION_STR;
            while (*v != 0) {
                ringbuf_write(&g_rb_out, *v++);
            }
            ringbuf_write(&g_rb_out, 0x0a);
        }
    }
    if (cmd[0] == 'P') {
        g_need_poll = 1;
    }
#if 0
    if (cmd[0] == 'C') {
        if (len != 5) return;
        uint8_t addr = hexchar2bin(&cmd[1]);
        uint8_t val = hexchar2bin(&cmd[3]);
        cfg_writereg_and_update(addr, val);
    } else if (g_raw_mode && cfg_separatelock()) {
        if (len != 5) return;
        if (cmd[2] != 'L') return;
        uint8_t addr = hexchar2bin(&cmd[0]);
        uint8_t lk = hexchar2bin(&cmd[3]);
        kbd_updatelocks(lk, addr);
    } else {
        if (cmd[0] != 'L') return;
        if (len != 3) return;
        uint8_t lk = hexchar2bin(&cmd[1]);
        kbd_updatelocks(lk, 0);
        spi_update_statusreg(g_numKbds > 0, lk);
    }
#endif
}

void main()
{
    if(!(P4_IN & (1 << 6))) {
        runBootloader();
    }
    ticks_init();
    ET0 = 1;

    static __xdata uint32_t t_last = 255;
    //uint8_t s;
    static __xdata uint8_t uart_buf_pos = 0;
    static __xdata uint8_t kbdconnected = 0;
    static __xdata uint8_t tgl = 0;
    static __xdata uint8_t cfg_pin;
    static __xdata uint8_t uartcmd[UART_CMD_MAXLEN];
    static __xdata uint8_t uartcmd_pos = 0;

    P0_PU = 0xf7;
    P1_PU = 0xff;
    P2_PU = 0x3f;
    P2_DIR = 0x80;
    P3_PU = 0xff;
    P3_DIR = 0x00;
    P3 = 0xff;
    P4_PU = 0xff;

    PORT_CFG &= 0xfb; // set P2 to push-pull mode
    
    for (uint8_t i = 0; i < sizeof(g_kbd_devIndex); i++) {
        g_kbd_devIndex[i] = -1;
    }
    for (uint8_t i = 0; i < MAX_NUM_KEYBOARDS; i++) {
        gamepad_state_clear(&g_state[i]);
    }
    g_numKbds = 0;

    // default configs
    uint16_t bd = UART1CalculateDivisor(9600);
    g_spireg[0] = VERSION_BYTE;
    g_spireg[1] = bd & 0x0ff;
    g_spireg[2] = bd >> 8;
    g_spireg[3] = 0x40 | 0x04;
    g_spireg[4] = 0;
    g_spireg[5] = 0;
    g_spireg[6] = 5;
    g_spireg[7] = 0x4c;

    // init others
    initClock();
    initUART0(230400, 1);
    initUART1(19200);
    DEBUG_OUT("======== Startup ========\n");
    //resetHubDevices(0);
    //resetHubDevices(1);
    initUSB_Host();
    setAttachCallback(usbAttachCallback);
    ringbuf_init(&g_rb_out);

    g_spiphase = 0;
    cfg_pin = P3;
    g_raw_mode = (P3 & (1 << 3)) == 0;
    if ((cfg_pin & (1 << 4)) == 0) {
        // software config (spi) mode
        DEBUG_OUT("Setting up SPI... ");
        PORT_CFG &= 0xfd;
        P1_PU &= 0x0f;
        P1_DIR &= 0x0f;
        SPI0_SETUP = 0x90;
        SPI0_CTRL = 0x81;
        SPI0_STAT = 0xff;
        g_spidata = 0;
        g_spiphase = 1;
        IE_SPI0 = 1;
        DEBUG_OUT("done.\n");
    } else {
        // hardware config mode
        uint8_t p1_in = P1;
        if ((cfg_pin & (1 << 5)) == 0) g_spireg[4] |= 0x80; // us keymap
        if ((cfg_pin & (1 << 6)) == 0) g_spireg[4] |= 0x10; // multibyte control sequence / separate locks
        if ((cfg_pin & (1 << 7)) == 0) g_spireg[3] = 0; // no repeat
        if ((p1_in & (1 << 4)) == 0) g_spireg[4] |= 0x07; // disable lock keys
        switch ((p1_in >> 5) ^ 0x07) {
            case 0: break;
            case 1: initUART1(14400); break;
            case 2: initUART1(19200); break;
            case 3: initUART1(28800); break;
            case 4: initUART1(38400); break;
            case 5: initUART1(57600); break;
            case 6: initUART1(76800); break;
            case 7: initUART1(115200); break;
        }
    }
    P3_PU = 0x03;
    EA = 1;
    init_watchdog(1);

    DEBUG_OUT("--- Ready ---\n");
    //DEBUG_OUT("P3 DIR=%02x PU=%02x P3=%02x\n", P3_DIR, P3_PU, P3);
    //DEBUG_OUT("P2 DIR=%02x PU=%02x P2=%02x\n", P2_DIR, P2_PU, P2);
    //DEBUG_OUT("PORT_CFG %02x\n", PORT_CFG);
    //ringbuf_write(&g_rb_out, '!');

    static __xdata uint32_t lasthubchecksecs;
    lasthubchecksecs = seconds();
    uint8_t lastsubtick = 0;
    uint8_t targetKbdIndex = 0;
    static GamepadState padforled;

    static UDevInterface iface_xinput;
    iface_xinput.spec.hid.reports[0].type = JOYSTICK_INPUT_TYPE_CONST;
    iface_xinput.spec.hid.reports[0].size = 8;
    iface_xinput.spec.hid.reports[0].count = 2;
    iface_xinput.spec.hid.reports[1].type = JOYSTICK_INPUT_TYPE_DPAD;
    iface_xinput.spec.hid.reports[1].size = 4;
    iface_xinput.spec.hid.reports[1].count = 1;
    iface_xinput.spec.hid.reports[2].type = JOYSTICK_INPUT_TYPE_BUTTON;
    iface_xinput.spec.hid.reports[2].size = 1;
    iface_xinput.spec.hid.reports[2].count = 12;
    iface_xinput.spec.hid.reports[3].type = JOYSTICK_INPUT_TYPE_TRIGGER;
    iface_xinput.spec.hid.reports[3].size = 8;
    iface_xinput.spec.hid.reports[3].count = 2;
    iface_xinput.spec.hid.reports[4].type = JOYSTICK_INPUT_TYPE_AXIS_POSNEG_16BIT;
    iface_xinput.spec.hid.reports[4].size = 8;
    iface_xinput.spec.hid.reports[4].count = 4;
    iface_xinput.spec.hid.num_reports = 5;

    while (1) {
        do {
            clear_watchdog();
            if(!(P4_IN & (1 << 6))) {
                P3 = 0xff;
                init_watchdog(0);
                runBootloader();
            }
            if (ringbuf_available(&g_rb_out) && UART1TxIsEmpty()) {
                p3_clear_inact();
                g_leddecr = 6;
                uint8_t d = ringbuf_pop(&g_rb_out);
                //DEBUG_OUT("sending %02x via UART1\n", d);
                UART1SendAsync(d);
            }
            if (UART1Available()) {
                uint8_t b = UART1Receive();
                if (b >= 0x20) {
                    uartcmd[uartcmd_pos] = b;
                    //DEBUG_OUT("UART in %02x\n", uartcmd[uartcmd_pos]);
                    if (uartcmd[uartcmd_pos] == ';') {
                        uartcmd[uartcmd_pos] = 0;
                        uartcmd_process(uartcmd);
                        uartcmd_pos = 0;
                    } else if (++uartcmd_pos >= sizeof(uartcmd)) {
                        uartcmd_pos = sizeof(uartcmd) - 1;
                    }
                }
            }
            switch (g_spiphase) {
                case 0: // spi is disabled, nop
                    break;
                case 1: // spi idle
                    break;
                case 2: // spi address received
                    break;
                case 3: // spi data received
                    DEBUG_OUT("SPI rcvd, @%02x/%02x, sent %02x\n", g_spiaddr, g_spidata, g_spisent);
                    g_spiphase++;
                    if (g_spiaddr & 0x80) {
                        cfg_writereg_and_update(g_spiaddr, g_spidata);
                    }
                    break;
                default:
                    if ((SPI0_SETUP & bS0_SLV_SELT) == 0) {
                        DEBUG_OUT("SPI reset.\n");
                        g_spiphase = 1;
                    }
                    break;
            }
        } while (lastsubtick == g_subticks);
        lastsubtick = g_subticks;

